## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 4 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "1917357983" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api"
        name      = "scan-files-api"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.api_auth_token will be created
  + resource "aws_ssm_parameter" "api_auth_token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/scan-files/api_auth_token"
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::806545929748:policy/api-0"
        name      = "api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:root"
                        }
                      - Sid       = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "api"
        name                  = "api"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "api"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "API_AUTH_TOKEN_SSM_NAME" = "/scan-files/api_auth_token"
                # (2 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
